Autodesk.Revit.DB.ViewNavigationToolSettings.GetViewNavigationToolSettings(Autodesk.Revit.DB.Document)
Gets the instance of the settings for the given document.
pADoc:
The document.
Returns:
The instance of the settings for the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016